package com.zanclick.prepay.web;

import com.alibaba.fastjson.JSONObject;
import com.alipay.api.AlipayApiException;
import com.alipay.api.AlipayClient;
import com.alipay.api.internal.util.AlipaySignature;
import com.alipay.api.response.MybankCreditSupplychainFactoringSupplierCreateResponse;
import com.alipay.api.response.MybankCreditSupplychainTradeBillrepaybudgetQueryResponse;
import com.zanclick.prepay.authorize.dto.AuthorizeDTO;
import com.zanclick.prepay.authorize.entity.AuthorizeConfiguration;
import com.zanclick.prepay.authorize.entity.AuthorizeMerchant;
import com.zanclick.prepay.authorize.entity.AuthorizeOrder;
import com.zanclick.prepay.authorize.entity.SupplyChainTrade;
import com.zanclick.prepay.authorize.pay.AuthorizePayService;
import com.zanclick.prepay.authorize.service.*;
import com.zanclick.prepay.authorize.util.AuthorizePayUtil;
import com.zanclick.prepay.authorize.util.MoneyUtil;
import com.zanclick.prepay.authorize.util.SupplyChainUtils;
import com.zanclick.prepay.authorize.vo.*;
import com.zanclick.prepay.common.config.JmsMessaging;
import com.zanclick.prepay.common.config.SendMessage;
import com.zanclick.prepay.common.utils.DataUtil;
import com.zanclick.prepay.common.utils.RedisUtil;
import com.zanclick.prepay.common.utils.StringUtils;
import com.zanclick.prepay.order.entity.PayOrder;
import com.zanclick.prepay.order.service.PayOrderService;
import com.zanclick.prepay.setmeal.entity.SetMeal;
import com.zanclick.prepay.setmeal.service.SetMealService;
import org.junit.Test;
import org.junit.runner.RunWith;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.test.context.SpringBootTest;
import org.springframework.test.context.junit4.SpringRunner;

import java.math.BigDecimal;
import java.util.ArrayList;
import java.util.Date;
import java.util.List;
import java.util.Map;

/**
 * @author lvlu
 * @date 2019-07-06 14:32
 **/
@RunWith(SpringRunner.class)
@SpringBootTest(classes = WebApplication.class)
public class ZftTest {

    @Autowired
    private AuthorizeMerchantService authorizeMerchantService;
    @Autowired
    private AuthorizeConfigurationService authorizeConfigurationService;
    @Autowired
    private AuthorizePayService authorizePayService;
    @Autowired
    private PayOrderService payOrderService;
    @Autowired
    private MyBankSupplyChainService myBankSupplyChainService;
    @Autowired
    private AuthorizeOrderService authorizeOrderService;
    @Autowired
    private SetMealService setMealService;

    @Test
    public void sssss(){
        AlipayClient client = authorizeConfigurationService.queryDefaultAlipayClient();
        AuthorizeDTO dto = new AuthorizeDTO();
        dto.setOut_order_no("157518675278378745353");
        dto.setOut_request_no("157518675278364533975");
        System.err.println(JSONObject.toJSONString(AuthorizePayUtil.query(client,dto)));
    }

    @Test
    public void ssss(){
        List<PayOrder> payOrderList = payOrderService.queryList(new PayOrder());
        for (PayOrder order:payOrderList){
            AuthorizeMerchant merchant = queryOne(order.getMerchantNo());
            if (merchant == null){
                payOrderService.deleteById(order.getId());
            }
            order.setWayId(merchant.getWayId());
            order.setStoreName(merchant.getStoreName());
            if (order.getState().equals(0) || order.getState().equals(-1)){
                order.setDealState(PayOrder.DealState.notice_wait.getCode());
            }
        }

    }

    private AuthorizeMerchant queryOne(String merchantNo){
        AuthorizeMerchant merchant = new AuthorizeMerchant();
        merchant.setState(1);
        merchant.setMerchantNo(merchantNo);
        List<AuthorizeMerchant> merchantList = authorizeMerchantService.queryList(merchant);
        if (DataUtil.isNotEmpty(merchantList)){
            return merchantList.get(0);
        }
        return null;
    }


    @Test
    public void sss(){
        List<RegisterMerchant> merchantList = ExcelUtil.readExcel("E:\\excel\\2019110902.xls","Sheet1");
        for (RegisterMerchant merchant:merchantList){
            createAuthorizeMerchant(merchant);
        }
    }

    @Test
    public void ss(){
        AuthorizeMerchant query = new AuthorizeMerchant();
        query.setState(0);
        List<AuthorizeMerchant> merchantList = authorizeMerchantService.queryList(query);
        for (AuthorizeMerchant merchant:merchantList){
            try {
                createSupplier(merchant);
            }catch (Exception e){
                e.printStackTrace();
            }

        }
    }

    @Test
    public void s(){
        String s = "0f8ecac0-b5fe-3305-aeff-a61b22f1c4e3|ZDJXRW882430K|（201908新入网自带机）承诺使用88元及以上4G套餐24个月每月减免30元话费（插卡类）|88元/月|24|720\n" +
                "3411d942-fca8-3eae-855f-3439ae6184ca|ZDJXRW41991012K|新入网199元5G套餐12个月直降1090_插卡|199元/月|12|1200\n" +
                "5395aa4c-cc65-3473-a2a9-aee5f7fb16f0|ZDJJT882440K|（家庭最低消费199元）承诺使用88元及以上4G套餐24个月每月减免40元话费（插卡类）|189元/月|24|960\n" +
                "ff419125-4406-3ee0-a42c-95368c3f7ccb|ZDJXRW358912FK|新入网589元5G套餐12个月直降2180_非插卡|589元/月|12|2400\n" +
                "a71f7354-faf8-3d9c-85e5-1e9046737263|ZDJXRW43891924K|新入网389元5G套餐24个月直降3800_插卡|389元/月|24|4560\n" +
                "4dc52f59-9b99-331b-9f29-47617cb73edb|ZDJJT1382460K|（家庭最低消费299元）承诺使用138元及以上4G套餐24个月每月减免60元话费（插卡类）|138元/月|24|1440\n" +
                "f5f31c06-be1f-3cd3-862e-4b5852834d8c|ZDJJT1881280K|承诺家庭低消399元12个月直降870（插卡类）|239元/月|12|960\n" +
                "36af5c21-a4ae-3bb7-be13-7731fdbd90f0|ZDJXRW41394012K|承诺升档至139元5G套餐12个月直降435元(插卡类）|139元/月|12|480\n" +
                "c8d41207-b0a5-3304-ab9f-5c729a583679|ZDJCL882425K|（201910存量自带机）承诺升档至88元及以上4G套餐24个月每月减免25元话费（88元及以下_插卡类）|88元/月|24|600\n" +
                "aec33e15-603d-3147-8546-294b7e1eb13b|ZDJJT1382460FK|（家庭最低消费299元）承诺使用138元及以上4G套餐24个月每月减免60元话费（非插卡类）|239元/月|24|1440\n" +
                "c370ffa5-1a90-3e96-953e-e8c867c50468|ZDJJT882440FK|（家庭最低消费199元）承诺使用88元及以上4G套餐24个月每月减免40元话费（非插卡类）|88元/月|24|960\n" +
                "9d1060be-4c34-333f-a04e-a592d45e25ed|ZDJXRW3189900K|加1元升档至189元20G套餐24期直降900_插卡|189元/月|24|1080\n" +
                "0787366b-57bd-3021-8eb8-cdb659ae6040|ZDJXRW3189490K|加1元升档至189元8G套餐12期直降490_插卡|189元/月|12|540\n" +
                "ad221751-d0c7-3748-81a8-699253872542|ZDJXRW42391212FK|新入网239元5G套餐12个月直降1310_非插卡|239元/月|12|1440\n" +
                "72cdae12-504f-3b3e-ac8f-3456590887c4|ZDJCL1082430FK|（201910存量自带机）承诺升档至108元及以上4G套餐24个月每月减免30元话费（88元及以下_非插卡类）|109元/月|24|720\n" +
                "df2a34fd-9a0c-31c3-8e9d-70f643a25d14|ZDJXRW41991012FK|新入网199元5G套餐12个月直降1090_非插卡|199元/月|12|1200\n" +
                "6ef14c7c-3824-31a2-9613-43bf06c18eb0|ZDJJT23824120FK|（家庭最低消费599元）承诺使用288元及以上4G套餐24个月每月减免120元话费（非插卡类）|389元/月|24|2880\n" +
                "47d49c45-f83c-3212-bd14-cd6e172763a7|ZDJXRW328924FK|新入网289元5G套餐24个月直降2100_非插卡|289元/月|24|2520\n" +
                "bd874de8-7297-397f-995c-abdbc22cc3af|ZDJXRW3189800FK|承诺升档至189元5G套餐24个月直降800元(非插卡类）|189元/月|24|960\n" +
                "5324c739-17b2-3d73-b4a1-03cff92440fd|ZDJXRW1082430K|（201908新入网自带机）承诺使用108元及以上4G套餐24个月每月减免30元话费（插卡类）|108元/月|24|720\n" +
                "0f67f9b2-0d80-3664-8f3c-10ed7e17d109|ZDJCL2881240FK|（201908存量自带机）承诺升档至288元及以上4G套餐12个月每月减免40元话费（238元升档_非插卡类）|288元/月|12|480\n" +
                "94cc099d-45d9-3b6f-b0aa-64b4b19a294e|ZDJCL2882470K|（201908存量自带机）承诺升档至288元及以上4G套餐24个月每月减免70元话费（188元及以下_插卡类）|288元/月|24|1680\n" +
                "9681bd34-d793-3a6b-934f-3c725724445f|ZDJCL2418855K|（201910存量自带机）承诺升档至188元及以上4G套餐24个月每月减免55元话费（88元及以下升档_插卡类）|188元/月|24|1320\n" +
                "650f1fd3-0953-3b44-865f-2e1735912efa|XYHFQ13830K|（201910校园）承诺使用138元及以上4G套餐24个月每月减免30元话费（插卡类）|138元/月|24|720\n" +
                "ce490b5a-6d2e-38ad-a9a3-c979e58f841f|ZDJJT1881280FK|承诺家庭低消399元12个月直降870（非插卡类）|289元/月|12|960\n" +
                "b56551b0-f4ba-3c2a-a343-c7ca79a6261f|ZDJCL2381240K|（201908存量自带机）承诺升档至238元及以上4G套餐12个月每月减免40元话费（188元升档_插卡类）|238元/月|12|480\n" +
                "1adb5023-b96b-35c8-bc24-23c63a77db0d|ZDJJT1881280K|承诺家庭低消399元12个月直降870（插卡类）|238元/月|12|960\n" +
                "b6d376e4-da71-3fcf-9090-ae65ac4657b3|ZDJJT1382460FK|（家庭最低消费299元）承诺使用138元及以上4G套餐24个月每月减免60元话费（非插卡类）|138元/月|24|1440\n" +
                "560219cb-4550-3a5e-8819-0eedc21fe1e3|ZDJXRW32395012K|加1元升档至239元10G套餐12期直降545_插卡|239元/月|12|600\n" +
                "f07c83ac-6e1d-35ac-bdc4-29deb0663fe0|ZDJJT23824120FK|（家庭最低消费599元）承诺使用288元及以上4G套餐24个月每月减免120元话费（非插卡类）|288元/月|24|2880\n" +
                "0e48f1f5-fe6c-31d3-9dc9-1528ac0dce07|ZDJXRW45891512FK|承诺升档至589元5G套餐12个月直降1635元(非插卡类）|589元/月|12|1800\n" +
                "650d7e98-b145-3b2b-8af9-7cac37ce8bc7|ZDJXRW42397024FK|承诺升档至239元5G套餐24个月直降1400元(非插卡类）|239元/月|24|1680\n" +
                "584da03a-5cc3-3f02-8513-ab2a746f6198|ZDJJT23824120FK|（家庭最低消费599元）承诺使用288元及以上4G套餐24个月每月减免120元话费（非插卡类）|388元/月|24|2880\n" +
                "6f0a6b9d-4386-31b9-9ee4-9207380962a9|ZDJCL881225K|（201910存量自带机）承诺升档至88元及以上4G套餐12个月每月减免25元话费（88元及以下_插卡类）|89元/月|12|300\n" +
                "63e67bd9-9085-30e4-bc2e-2e2bfce56171|ZDJXRW45893024K|新入网589元5G套餐24个月直降6000_插卡|589元/月|24|7200\n" +
                "6782bfaa-0ad3-38be-8a18-0aa14d4e58f2|ZDJXRW1882470K|（201908新入网自带机）承诺使用188元及以上4G套餐24个月每月减免70元话费（插卡类）|188元/月|24|1680\n" +
                "452e2e70-28b4-3f37-be5b-03e7f7382a90|ZDJJT1381260K|承诺家庭低消299元12个月直降650（插卡类）|188元/月|12|720\n" +
                "e54affdc-62ac-3f5b-bcb5-94b4fc10e0df|ZDJJT1381260FK|承诺家庭低消299元12个月直降650（非插卡类）|189元/月|12|720\n" +
                "c0b53402-6a94-3030-bf7c-59b0e07f5845|ZDJXRW43898024K|承诺升档至389元5G套餐24个月直降1600元(插卡类）|389元/月|24|1920\n" +
                "5f3928fd-27cb-33a8-873f-5eb9942641db|ZDJCL1882470FK|（201908存量自带机）承诺升档至188元及以上4G套餐24个月每月减免70元话费（88元及以下_非插卡类）|188元/月|24|1680\n" +
                "435f3e41-3c27-3505-8ea3-af4288d3952f|ZDJJT1382460FK|（家庭最低消费299元）承诺使用138元及以上4G套餐24个月每月减免60元话费（非插卡类）|288元/月|24|1440\n" +
                "a3372361-2c02-3249-99cb-347d2821f701|ZDJJT1881280FK|承诺家庭低消399元12个月直降870（非插卡类）|189元/月|12|960\n" +
                "6ceb5287-30a2-3113-9321-e5a913942906|ZDJCL1881270FK|（201908存量自带机）承诺升档至188元及以上4G套餐12个月每月减免70元话费（88元及以下_非插卡类）|188元/月|12|840\n" +
                "7d5086d5-ecb9-36fc-9d0e-c203de1f3325|ZDJJT1382460K|（家庭最低消费299元）承诺使用138元及以上4G套餐24个月每月减免60元话费（插卡类）|189元/月|24|1440\n" +
                "d72e449c-8c0f-33ce-8b9e-2394987cb2db|ZDJXRW42898012K|承诺升档至289元5G套餐12个月直降875元(插卡类）|289元/月|12|960\n" +
                "c19c73f0-0203-3b84-8e9c-33b5c93b1be6|ZDJCL2382440FK|（201908存量自带机）承诺升档至238元及以上4G套餐24个月每月减免40元话费（188元升档_非插卡类）|238元/月|24|960\n" +
                "f40bb07a-2e18-3125-bfd2-e4b009bd1952|ZDJJT1881280K|承诺家庭低消399元12个月直降870（插卡类）|189元/月|12|960\n" +
                "f5df7ecf-5399-3fc8-b5df-5b5d89aa613b|ZDJCLX2881250FK|（201910存量自带机）承诺使用288元及以上4G套餐12个月每月减免50元话费（非插卡类）|288元/月|12|600\n" +
                "2d8fd0b4-5fcf-3ba8-9354-e2e47c4f066a|ZDJCL1223850FK|（201910存量自带机）承诺升档至238元及以上4G套餐12个月每月减免50元话费（188元及以下升档_非插卡类）|238元/月|12|600\n" +
                "2240358f-f65e-3c60-82a7-01af17553f0d|ZDJCL881225FK|（201910存量自带机）承诺升档至88元及以上4G套餐12个月每月减免25元话费（88元及以下_非插卡类）|88元/月|12|300\n" +
                "1dd3216e-eb70-3998-94af-6209a16b0ce9|ZDJXRW1081230FK|（201908新入网自带机）承诺使用108元及以上4G套餐12个月每月减免30元话费（非插卡类）|108元/月|12|360\n" +
                "1452c75e-ce84-3368-b477-125f1475bfc1|ZDJXRW42397024K|承诺升档至239元5G套餐24个月直降1400元(插卡类）|239元/月|24|1680\n" +
                "acee5606-d18e-3eef-bf33-ef8faa11f23c|ZDJXRW32395024K|加1元升档至239元22G套餐24期直降1000_插卡|239元/月|24|1200\n" +
                "d06b7414-90d2-36d7-a02f-377cbdbe2c02|ZDJCLX1882440FK|（201910存量自带机）承诺使用188元及以上4G套餐24个月每月减免40元话费（非插卡类）|188元/月|24|960\n" +
                "81237ab1-ce10-362e-94ef-b6d70ec66d01|ZDJJT1381260K|承诺家庭低消299元12个月直降650（插卡类）|138元/月|12|720\n" +
                "f5561f9e-a1f2-3252-bb0c-ec322c78c83f|ZDJXRW41394012FK|承诺升档至139元5G套餐12个月直降435元(非插卡类）|139元/月|12|480\n" +
                "38ecf78e-c49b-3820-9000-9a15c06a496c|ZDJCL1881270K|（201908存量自带机）承诺升档至188元及以上4G套餐12个月每月减免70元话费（88元及以下_插卡类）|188元/月|12|840\n" +
                "490b775a-a544-3900-b84c-e01bef276ea6|ZDJJT1881280FK|承诺家庭低消399元12个月直降870（非插卡类）|389元/月|12|960\n" +
                "71de8445-ff47-38a8-927d-4e49958f7fa7|ZDJJT23812120FK|承诺家庭低消599元12个月直降1300（非插卡类）|288元/月|12|1440\n" +
                "b96f67b1-1719-308b-bec0-13dcd5306ec4|ZDJJT881240FK|承诺家庭低消199元12个月直降430（非插卡类）|89元/月|12|480\n" +
                "72282c75-da4f-3885-81cd-28bfe04f4f17|ZDJCLX1882440K|（201910存量自带机）承诺使用188元及以上4G套餐24个月每月减免40元话费（插卡类）|188元/月|24|960\n" +
                "327faad2-4eda-307a-9143-4bdc7fc58dac|ZDJJT1881280FK|承诺家庭低消399元12个月直降870（非插卡类）|388元/月|12|960\n" +
                "dc841d88-2e0a-343a-a077-543f7e357694|ZDJJT1382460K|（家庭最低消费299元）承诺使用138元及以上4G套餐24个月每月减免60元话费（插卡类）|289元/月|24|1440\n" +
                "3dba86d0-c1eb-3292-86d4-2030a266320b|ZDJCLX2381240K|（201910存量自带机）承诺使用238元及以上4G套餐12个月每月减免40元话费（插卡类）|238元/月|12|480\n" +
                "36fce4dd-ca6e-398c-b062-0865638b0464|ZDJCL2382470FK|（201908存量自带机）承诺升档至238元及以上4G套餐24个月每月减免70元话费（138元及以下_非插卡类）|238元/月|24|1680\n" +
                "e1ac0fe5-7077-3179-9b4e-5b4b08e64c0b|ZDJXRW1082430FK|（201908新入网自带机）承诺使用108元及以上4G套餐24个月每月减免30元话费（非插卡类）|108元/月|24|720\n" +
                "c1c06537-93f4-3c26-a5f8-4ca47e8bd9fc|ZDJJT1382460K|（家庭最低消费299元）承诺使用138元及以上4G套餐24个月每月减免60元话费（插卡类）|188元/月|24|1440\n" +
                "63e9f439-02c3-3e78-a2b7-c06977f4fc1d|ZDJXRW42891412FK|新入网289元5G套餐12个月直降1530_非插卡|289元/月|12|1680\n" +
                "a1f3c118-979a-3ca7-a868-a31187cd05b7|ZDJCL881225K|（201910存量自带机）承诺升档至88元及以上4G套餐12个月每月减免25元话费（88元及以下_插卡类）|88元/月|12|300\n" +
                "0916bb61-dfbc-3a82-b9f1-22f3102ad6ad|ZDJJT1381260FK|承诺家庭低消299元12个月直降650（非插卡类）|188元/月|12|720\n" +
                "114e3ffb-1fec-3afe-9e62-f7fa2996e155|ZDJJT1881280FK|承诺家庭低消399元12个月直降870（非插卡类）|188元/月|12|960\n" +
                "66fb94a4-20dc-392e-932e-135e5d82ab1e|ZDJXRW31891400K|承诺升档至189元5G套餐24个月直降1400元(插卡类）|189元/月|24|1680\n" +
                "e9d0a93a-e417-3e16-8171-b67c66629bdb|ZDJCL1082430K|（201910存量自带机）承诺升档至108元及以上4G套餐24个月每月减免30元话费（88元及以下_插卡类）|109元/月|24|720\n" +
                "b35243af-a571-38d2-a6e5-981684e17390|ZDJCL1228880FK|（201910存量自带机）承诺升档至288元及以上4G套餐12个月每月减免80元话费（188元及以下升档_非插卡类）|288元/月|12|960\n" +
                "0de357ed-f823-305c-bf69-ac59edf80369|ZDJXRW33897012FK|加1元升档至389元13G套餐12期直降765_非插卡|389元/月|12|840\n" +
                "f9228aec-2bb1-3ff0-afe4-9c1d98cbba3f|ZDJJT882440FK|（家庭最低消费199元）承诺使用88元及以上4G套餐24个月每月减免40元话费（非插卡类）|89元/月|24|960\n" +
                "fb10c4a9-f44f-3c78-b0cb-ed6f64d9dfe0|ZDJJT1881280K|承诺家庭低消399元12个月直降870（插卡类）|188元/月|12|960\n" +
                "e22cc133-c693-32b6-8cea-33fcba839d8f|ZDJJT23824120K|（家庭最低消费599元）承诺使用288元及以上4G套餐24个月每月减免120元话费（插卡类）|288元/月|24|2880\n" +
                "188a564f-c688-3b43-b64a-743353704853|ZDJCLX58812100FK|（201910存量自带机）承诺使用588元及以上4G套餐12个月每月减免100元话费（非插卡类）|588元/月|12|1200\n" +
                "51b18988-dc89-3b04-a949-e92089336b02|ZDJJT882440FK|（家庭最低消费199元）承诺使用88元及以上4G套餐24个月每月减免40元话费（非插卡类）|139元/月|24|960\n" +
                "e6f48565-7c9c-3bba-a815-07c34e717cd5|ZDJXRW41394024FK|承诺升档至139元5G套餐24个月直降800元(非插卡类）|139元/月|24|960\n" +
                "44d54d6d-ba6b-3d86-93f5-9ea5a1215c93|ZDJJT881240K|承诺家庭低消199元12个月直降430（插卡类）|189元/月|12|480\n" +
                "27241389-b954-37ec-b7ed-f1930ccdf396|ZDJCLX2382440FK|（201910存量自带机）承诺使用238元及以上4G套餐24个月每月减免40元话费（非插卡类）|238元/月|24|960\n" +
                "db55bd11-a185-349d-b871-924f5cb54efc|ZDJXRW313912K|新入网139元5G套餐12个月直降545_插卡|139元/月|12|600\n" +
                "4ba617f1-0490-3e2e-a199-90cbf5f9ee65|ZDJJT1882480K|（家庭最低消费399元）承诺使用188元及以上4G套餐24个月每月减免80元话费（插卡类）|389元/月|24|1920\n" +
                "95d61bdf-7c93-38fa-a432-551254ba0b44|ZDJCL1223850K|（201910存量自带机）承诺升档至238元及以上4G套餐12个月每月减免50元话费（188元及以下升档_插卡类）|238元/月|24|1200\n" +
                "ec756e64-8cfe-3768-9c49-397fe4c4c469|XYHFQ8820FK|（201910校园）承诺使用88元及以上4G套餐24个月每月减免20元话费（非插卡类）|88元/月|24|480\n" +
                "ffa260a0-5379-3e7e-aa58-48eb07d450f4|ZDJJT23812120K|承诺家庭低消599元12个月直降1300（插卡类）|389元/月|12|1440\n" +
                "1a5a9aa8-aaa4-3d50-90bc-5d3c11475a97|ZDJCL2382440K|（201908存量自带机）承诺升档至238元及以上4G套餐24个月每月减免40元话费（188元升档_插卡类）|238元/月|24|960\n" +
                "926ef9ab-714a-3ef3-a6ab-3886db8998ca|ZDJJT1381260K|承诺家庭低消299元12个月直降650（插卡类）|288元/月|12|720\n" +
                "a966adfb-61c1-3a3c-9dda-25e3567086a1|ZDJXRW41397024K|新入网139元5G套餐24个月直降1400_插卡|139元/月|24|1680\n" +
                "3cdce8ec-f930-3342-bbb1-9ab2a1b704a3|ZDJCL1882470K|（201908存量自带机）承诺升档至188元及以上4G套餐24个月每月减免70元话费（88元及以下_插卡类）|188元/月|24|1680\n" +
                "725ed4d4-123b-3d7f-abc0-d3931c724770|ZDJXRW358910012K|加1元升档至589元16G套餐12期直降1090_插卡|589元/月|12|1200\n" +
                "70260769-a24a-39f0-b1b9-a6b95235ca13|ZDJCL1218855FK|（201910存量自带机）承诺升档至188元及以上4G套餐12个月每月减免55元话费（88元及以下升档_非插卡类）|188元/月|12|660\n" +
                "517754fd-f04c-3b54-9f96-f505a6f3846f|ZDJXRW32896012K|加1元升档至289元12G套餐12期直降655_插卡|289元/月|12|720\n" +
                "aec76fda-cb3b-31f9-8f54-5d1977440f80|ZDJCL1382440K|（201908存量自带机）承诺升档至138元及以上4G套餐24个月每月减免40元话费（88元及以下_插卡类）|138元/月|24|960\n" +
                "7cb02dfc-5193-3bb5-9b65-855b7ffe6751|ZDJXRW3189765FK|承诺升档至189元5G套餐12个月直降765元(非插卡类）|189元/月|12|840\n" +
                "eefaa1fc-9b6e-3957-8931-6586f41a21d3|ZDJJT23812120K|承诺家庭低消599元12个月直降1300（插卡类）|289元/月|12|1440\n" +
                "d3b54679-c9cd-380a-8521-46e5858baee3|ZDJXRW45891524FK|承诺升档至589元5G套餐24个月直降3000元(非插卡类）|589元/月|24|3600\n" +
                "f97817bb-bc0f-33b4-883d-119dee69eeaf|ZDJCL2381270K|（201908存量自带机）承诺升档至238元及以上4G套餐12个月每月减免70元话费（138元及以下_插卡类）|238元/月|12|840\n" +
                "f17ae9aa-c04f-3e68-a076-537bf59654f6|ZDJJT1882480K|（家庭最低消费399元）承诺使用188元及以上4G套餐24个月每月减免80元话费（插卡类）|189元/月|24|1920\n" +
                "d39a1907-21ba-3a3b-b8ad-223dde8d5345|ZDJXRW33897024K|加1元升档至389元26G套餐24期直降1400_插卡|389元/月|24|1680\n" +
                "a7df9b2c-8455-3303-bffa-0a9ce32b88dd|ZDJCLX58824100FK|（201910存量自带机）承诺使用588元及以上4G套餐24个月每月减免100元话费（非插卡类）|588元/月|24|2400\n" +
                "08059c5f-35ea-3cac-a881-57cee255c1bc|XYHFQ5820FK|（201910校园）承诺使用58元学而思套餐24个月每月减免20元话费（非插卡类）|58元/月|24|480\n" +
                "bc415d88-8188-30a0-bef7-a2ea232393d1|ZDJJT1381260FK|承诺家庭低消299元12个月直降650（非插卡类）|289元/月|12|720\n" +
                "e24f0d84-c120-3179-9460-4549904971b6|ZDJXRW1081230K|（201908新入网自带机）承诺使用108元及以上4G套餐12个月每月减免30元话费（插卡类）|109元/月|12|360\n" +
                "64dcbdea-c5b6-30c0-a12e-d67af140038a|ZDJXRW319924FK|新入网199元5G套餐24个月直降1400_非插卡|199元/月|24|1680\n" +
                "0721a51a-5994-3406-9024-449baa450405|ZDJJT1381260K|承诺家庭低消299元12个月直降650（插卡类）|139元/月|12|720\n" +
                "e83c2318-b448-37ff-b8c7-9cdbcec9d07f|ZDJXRW328924K|新入网289元5G套餐24个月直降2100_插卡|289元/月|24|2520\n" +
                "b741307f-d7dd-3e8a-a7b2-039b2ada3e9c|ZDJXRW358912K|新入网589元5G套餐12个月直降2180_插卡|589元/月|12|2400\n" +
                "3d82284d-ecf9-3201-b6da-b91dd90c48c6|ZDJJT1382460K|（家庭最低消费299元）承诺使用138元及以上4G套餐24个月每月减免60元话费（插卡类）|239元/月|24|1440\n" +
                "1fe30ec0-8347-3630-afdf-a649f11e17aa|ZDJJT882440K|（家庭最低消费199元）承诺使用88元及以上4G套餐24个月每月减免40元话费（插卡类）|139元/月|24|960\n" +
                "fb002f3e-8e55-371a-b7c2-d1232f272aec|ZDJXRW43891912K|新入网389元5G套餐12个月直降2075_插卡|389元/月|12|2280\n" +
                "d9106532-398f-34dc-beb3-279dac2f7fbc|ZDJJT23824120K|（家庭最低消费599元）承诺使用288元及以上4G套餐24个月每月减免120元话费（插卡类）|389元/月|24|2880\n" +
                "b633ea6c-9de1-32df-a431-a91fe2d81db7|ZDJCL1882440FK|（201908存量自带机）承诺升档至188元及以上4G套餐24个月每月减免40元话费（138元升档_非插卡类）|188元/月|24|960\n" +
                "268ac980-20ad-3080-ab27-d8cad7ca7bdb|ZDJJT23812120FK|承诺家庭低消599元12个月直降1300（非插卡类）|289元/月|12|1440\n" +
                "b40c3363-2a71-39bf-82fa-db39ee98352f|ZDJJT1882480K|（家庭最低消费399元）承诺使用188元及以上4G套餐24个月每月减免80元话费（插卡类）|238元/月|24|1920\n" +
                "cfe78787-1705-3d2b-a704-9f6597a09610|ZDJXRW881230K|（201908新入网自带机）承诺使用88元及以上4G套餐12个月每月减免30元话费（插卡类）|88元/月|12|360\n" +
                "cd084b08-0c2b-3c67-848e-9223ca9f25ee|ZDJXRW319924K|新入网199元5G套餐24个月直降1400_插卡|199元/月|24|1680\n" +
                "acf02478-9d2c-3e7f-a4ba-708abdce450d|ZDJCLX2881250K|（201910存量自带机）承诺使用288元及以上4G套餐12个月每月减免50元话费（插卡类）|288元/月|12|600\n" +
                "155a3c52-a238-3611-b6ee-b14cf7b623f9|ZDJJT1382460FK|（家庭最低消费299元）承诺使用138元及以上4G套餐24个月每月减免60元话费（非插卡类）|188元/月|24|1440\n" +
                "7c162152-facf-3192-9c60-00134777f55e|ZDJJT1882480FK|（家庭最低消费399元）承诺使用188元及以上4G套餐24个月每月减免80元话费（非插卡类）|388元/月|24|1920\n" +
                "e6c2e101-bca9-3997-8cba-dd4bc2c30c14|ZDJJT1381260K|承诺家庭低消299元12个月直降650（插卡类）|239元/月|12|720\n" +
                "211c09a6-1ab7-32a2-a6aa-0aad3e8fa725|ZDJXRW32896024K|加1元升档至289元24G套餐24期直降1200_插卡|289元/月|24|1440\n" +
                "60abc97b-278d-33e6-aab9-65aa321de3ec|ZDJXRW358910024FK|加1元升档至589元27G套餐24期直降2000_非插卡|589元/月|24|2400\n" +
                "255a414f-57ec-3057-81a9-537aa67bfadb|ZDJCL1081230K|（201910存量自带机）承诺升档至108元及以上4G套餐12个月每月减免30元话费（88元及以下_插卡类）|108元/月|12|360\n" +
                "049e55e2-c158-36a2-9685-32f1a312e39f|ZDJXRW42397012K|承诺升档至239元5G套餐12个月直降765元(插卡类）|239元/月|12|840\n" +
                "ba4eb6fa-7694-3059-9f76-fad191716322|ZDJJT1881280FK|承诺家庭低消399元12个月直降870（非插卡类）|288元/月|12|960\n" +
                "f6696011-f0cc-3f69-b555-d628ffe7cbd7|ZDJJT1382460FK|（家庭最低消费299元）承诺使用138元及以上4G套餐24个月每月减免60元话费（非插卡类）|289元/月|24|1440\n" +
                "07208a65-c30d-3624-9bc1-56d539c2c322|ZDJJT881240FK|承诺家庭低消199元12个月直降430（非插卡类）|139元/月|12|480\n" +
                "c9567619-f6fa-36c8-866f-7492ec6c7b6d|ZDJXRW42898024K|承诺升档至289元5G套餐24个月直降1600元(插卡类）|289元/月|24|1920\n" +
                "b4197ff8-7014-385e-ab2d-dbc61d7a9c39|ZDJCL1228880K|（201910存量自带机）承诺升档至288元及以上4G套餐12个月每月减免80元话费（188元及以下升档_插卡类）|288元/月|12|960\n" +
                "b714eea9-5b30-3dc8-85c9-641a2e4b2ecc|ZDJXRW45891512K|承诺升档至589元5G套餐12个月直降1635元(插卡类）|589元/月|12|1800\n" +
                "a78d5fa7-2264-3127-b7f7-e7dabbe1593b|ZDJCL2882440FK|（201908存量自带机）承诺升档至288元及以上4G套餐24个月每月减免40元话费（238元升档_非插卡类）|288元/月|24|960\n" +
                "6522540e-fa70-3a5a-94d6-161242d772f3|ZDJCLX3881270FK|（201910存量自带机）承诺使用388元及以上4G套餐12个月每月减免70元话费（非插卡类）|388元/月|12|840\n" +
                "97b09ada-f60f-34ca-bc6e-6f0a0283a0b9|ZDJCLX2882450K|（201910存量自带机）承诺使用288元及以上4G套餐24个月每月减免50元话费（插卡类）|288元/月|24|1200\n" +
                "c3916afe-8451-3426-a2c4-d357156faff9|XYHFQ5820K|（201910校园）承诺使用58元学而思套餐24个月每月减免20元话费（插卡类）|58元/月|24|480\n" +
                "2a485fd5-2f69-39a4-91bc-a01465bda85f|ZDJCL2881270K|（201908存量自带机）承诺升档至288元及以上4G套餐12个月每月减免70元话费（188元及以下_插卡类）|288元/月|12|840\n" +
                "5970f74d-4a42-3915-a6e8-d581539584a7|ZDJCLX1382430FK|（201910存量自带机）承诺使用138元及以上4G套餐24个月每月减免30元话费（非插卡类）|138元/月|24|720\n" +
                "f815d3f5-1b0d-30d2-84a8-0a8ee1f4dcd8|ZDJJT23824120K|（家庭最低消费599元）承诺使用288元及以上4G套餐24个月每月减免120元话费（插卡类）|289元/月|24|2880\n" +
                "021e8de5-ffbe-3dca-a6f8-65fa2d019314|ZDJXRW3189490FK|加1元升档至189元7G套餐12期直降490_非插卡|189元/月|12|540\n" +
                "c1806f9f-3571-38bc-8f05-5f150584eebb|XYHFQ13830FK|（201910校园）承诺使用138元及以上4G套餐24个月每月减免30元话费（非插卡类）|138元/月|24|720\n" +
                "c32fc45d-9a74-30d0-8212-5535849eba11|ZDJXRW32896024FK|加1元升档至289元23G套餐24期直降1200_非插卡|289元/月|24|1440\n" +
                "b82b9779-de02-30dc-bdb2-04719458fa55|ZDJXRW31393512FK|加1元升档至139元5G套餐12期直降380_非插卡|139元/月|12|420\n" +
                "64c6aa88-ecb2-3013-b37e-ef7cce19bb7b|ZDJCL2418855FK|（201910存量自带机）承诺升档至188元及以上4G套餐24个月每月减免55元话费（88元及以下升档_非插卡类）|188元/月|24|1320\n" +
                "60687868-a370-33ea-804f-45bdd6e0ebe5|ZDJXRW43898012FK|承诺升档至389元5G套餐12个月直降875元(非插卡类）|389元/月|12|960\n" +
                "bf9370eb-907a-37a9-9f77-732c11868b8a|ZDJCLX3882470K|（201910存量自带机）承诺使用388元及以上4G套餐24个月每月减免70元话费（插卡类）|388元/月|24|1680\n" +
                "849d1991-1297-3d41-8c6b-34bfe8d9786f|ZDJXRW1382450K|（201908新入网自带机）承诺使用138元及以上4G套餐24个月每月减免50元话费（插卡类）|138元/月|24|1200\n" +
                "a89ac832-e468-3b31-8c82-78305321bb04|ZDJXRW1381250FK|（201908新入网自带机）承诺使用138元及以上4G套餐12个月每月减免50元话费（非插卡类）|138元/月|12|600\n" +
                "6a793a36-588e-3678-b143-17047f689d85|ZDJCL1228860K|（201910存量自带机）承诺升档至288元及以上4G套餐12个月每月减免60元话费（238元升档_插卡类）|288元/月|12|720\n" +
                "be540f7a-3b60-36c1-a92a-4ac3ddaf6693|ZDJXRW313924K|新入网139元5G套餐24个月直降1000_插卡|139元/月|24|1200\n" +
                "7154634b-1e0a-3739-9b92-163b4994841f|ZDJXRW33897012K|加1元升档至389元14G套餐12期直降765_插卡|389元/月|12|840\n" +
                "e607a864-6a96-3d66-b9b6-eb9e70210569|ZDJXRW31393524K|加1元升档至139元18G套餐24期直降700_插卡|139元/月|24|840\n" +
                "3c5bea23-35b7-3f40-806c-e0a58e359402|ZDJJT1881280FK|承诺家庭低消399元12个月直降870（非插卡类）|239元/月|12|960\n" +
                "2431ec58-ee55-31a7-afb7-3faa722bf3dd|ZDJJT1882480FK|（家庭最低消费399元）承诺使用188元及以上4G套餐24个月每月减免80元话费（非插卡类）|239元/月|24|1920\n" +
                "93707d24-71b5-3b0d-a1a1-e32ad329503e|ZDJXRW3189800K|承诺升档至189元5G套餐24个月直降800元(插卡类）|189元/月|24|960\n" +
                "6ee670c7-2d10-3b99-8ef2-ce0edfafebf7|ZDJJT882440K|（家庭最低消费199元）承诺使用88元及以上4G套餐24个月每月减免40元话费（插卡类）|88元/月|24|960\n" +
                "5eeb3a69-9ea7-395d-b30b-6e08a98f4e8d|ZDJXRW323924FK|新入网239元5G套餐24个月直降1600_非插卡|239元/月|24|1920\n" +
                "b6b40001-ba39-3d30-a414-d84e8c91a875|ZDJCL2381240FK|（201908存量自带机）承诺升档至238元及以上4G套餐12个月每月减免40元话费（188元升档_非插卡类）|238元/月|12|480\n" +
                "12df7be4-0dab-3239-81de-078ea39f238c|ZDJJT1381260FK|承诺家庭低消299元12个月直降650（非插卡类）|288元/月|12|720\n" +
                "5ede356c-7950-3ee6-b67d-65b38d9f3286|ZDJCL882425FK|（201910存量自带机）承诺升档至88元及以上4G套餐24个月每月减免25元话费（88元及以下_非插卡类）|89元/月|24|600\n" +
                "a530fdbd-813d-3cc5-91d6-d024ca10a0ed|ZDJXRW3189900FK|加1元升档至189元19G套餐24期直降900_非插卡|189元/月|24|1080\n" +
                "5b4a5174-cc58-3fde-8705-efdd4482adbc|ZDJXRW1881270K|（201908新入网自带机）承诺使用188元及以上4G套餐12个月每月减免70元话费（插卡类）|188元/月|12|840\n" +
                "5bd3a965-43c9-3e2f-81e4-ac669488218d|ZDJJT882440K|（家庭最低消费199元）承诺使用88元及以上4G套餐24个月每月减免40元话费（插卡类）|89元/月|24|960\n" +
                "337e3832-3ab3-3dfa-bd8a-e5feeedcf26d|ZDJXRW42391224FK|新入网239元5G套餐24个月直降2400_非插卡|239元/月|24|2880\n" +
                "68343949-9012-34b9-8aa9-908e57791358|XYHFQ8820K|（201910校园）承诺使用88元及以上4G套餐24个月每月减免20元话费（插卡类）|88元/月|24|480\n" +
                "4c434a9a-d2c9-3505-a622-e07da96d2d95|ZDJXRW338912K|新入网389元5G套餐12个月直降1530_插卡|389元/月|12|1680\n" +
                "7c6d2cf8-3904-36e3-9564-49615df564e0|ZDJJT1881280K|承诺家庭低消399元12个月直降870（插卡类）|389元/月|12|960\n" +
                "e14a11e2-ed29-3947-98ee-722d817f07e8|ZDJXRW3189435K|承诺升档至189元5G套餐12个月直降435元(插卡类）|189元/月|12|480\n" +
                "8c5f1794-f0e7-33ab-93ca-00d9d8a9278d|ZDJXRW43898012K|承诺升档至389元5G套餐12个月直降875元(插卡类）|389元/月|12|960\n" +
                "f04f8d37-0a69-3d03-8ac9-b75329adcb4b|ZDJCL2381270FK|（201908存量自带机）承诺升档至238元及以上4G套餐12个月每月减免70元话费（138元及以下_非插卡类）|238元/月|12|840\n" +
                "cdfc9ebf-f13a-3ce8-86b8-33454e4a5376|ZDJJT1882480FK|（家庭最低消费399元）承诺使用188元及以上4G套餐24个月每月减免80元话费（非插卡类）|189元/月|24|1920\n" +
                "b382cf48-6f32-392c-91fc-d722ba63ee0d|ZDJXRW45891524K|承诺升档至589元5G套餐24个月直降3000元(插卡类）|589元/月|24|3600\n" +
                "4498b72d-6e75-39e9-a143-acdf1c005ab2|ZDJCL1223850K|（201910存量自带机）承诺升档至238元及以上4G套餐12个月每月减免50元话费（188元及以下升档_插卡类）|238元/月|12|600\n" +
                "7d169f11-a2a7-3fee-a429-b9b5512db81c|ZDJXRW881230FK|（201908新入网自带机）承诺使用88元及以上4G套餐12个月每月减免30元话费（非插卡类）|88元/月|12|360\n" +
                "ffb057a2-6fa8-3cd5-a39b-40ab9b2ad9b5|ZDJXRW1382450FK|（201908新入网自带机）承诺使用138元及以上4G套餐24个月每月减免50元话费（非插卡类）|138元/月|24|1200\n" +
                "3eb7c99a-2b75-37a6-8538-168584027e4d|ZDJCL2881240K|（201908存量自带机）承诺升档至288元及以上4G套餐12个月每月减免40元话费（238元升档_插卡类）|288元/月|12|480\n" +
                "44391421-adb5-39d8-89b6-4efd3373b5be|ZDJXRW3189765K|承诺升档至189元5G套餐12个月直降765元(插卡类）|189元/月|12|840\n" +
                "bf185f7d-1b0f-3f02-98ac-2b18a8c0171b|ZDJCL2428880K|（201910存量自带机）承诺升档至288元及以上4G套餐24个月每月减免80元话费（188元及以下升档_插卡类）|288元/月|24|1920\n" +
                "70875b1f-d363-3389-a118-aab305db2c36|ZDJXRW1381250K|（201908新入网自带机）承诺使用138元及以上4G套餐12个月每月减免50元话费（插卡类）|138元/月|12|600\n" +
                "648a6ad3-b942-3760-805b-bff1eea5d7d0|ZDJJT1881280FK|承诺家庭低消399元12个月直降870（非插卡类）|238元/月|12|960\n" +
                "b86a5764-a122-3fb0-8164-faa08cb265f1|ZDJXRW358910012FK|加1元升档至589元15G套餐12期直降1090_非插卡|589元/月|12|1200\n" +
                "bbfe1a10-92ca-3248-806f-8de21c22a14a|ZDJXRW313912FK|新入网139元5G套餐12个月直降545_非插卡|139元/月|12|600\n" +
                "a9fc8bfc-417f-3caf-be2d-ee1addab7411|ZDJJT881240FK|承诺家庭低消199元12个月直降430（非插卡类）|189元/月|12|480\n" +
                "e9791d71-baf2-36a8-abf6-c828f53ae405|ZDJCLX58812100K|（201910存量自带机）承诺使用588元及以上4G套餐12个月每月减免100元话费（插卡类）|588元/月|12|1200\n" +
                "5bc25435-fab9-3b3c-ae17-a29246c66011|ZDJCLX1381230FK|（201910存量自带机）承诺使用138元及以上4G套餐12个月每月减免30元话费（非插卡类）|138元/月|12|360\n" +
                "73f53c1b-03bf-3f35-acf8-7f1c81694d12|ZDJJT23812120FK|承诺家庭低消599元12个月直降1300（非插卡类）|388元/月|12|1440\n" +
                "9bf5b254-46ec-322d-80dd-8e688b958abb|ZDJCLX2381240FK|（201910存量自带机）承诺使用238元及以上4G套餐12个月每月减免40元话费（非插卡类）|238元/月|12|480\n" +
                "11e62797-0140-31fd-9149-40494407f2d7|ZDJJT1381260K|承诺家庭低消299元12个月直降650（插卡类）|189元/月|12|720\n" +
                "7074872b-2031-35ee-8d3a-7d066187221d|ZDJXRW323912FK|新入网239元5G套餐12个月直降870_非插卡|239元/月|12|960\n" +
                "369f9e3a-606e-3641-8401-e427df6cd26d|ZDJXRW42891424K|新入网289元5G套餐24个月直降2800_插卡|289元/月|24|3360\n" +
                "9b52175f-8efc-3bdd-b619-cc76455006e1|ZDJXRW42891412K|新入网289元5G套餐12个月直降1530_插卡|289元/月|12|1680\n" +
                "7dc77566-70d6-3549-a0c3-d9722726e369|ZDJCL2382470K|（201908存量自带机）承诺升档至238元及以上4G套餐24个月每月减免70元话费（138元及以下_插卡类）|238元/月|24|1680\n" +
                "e3a137a9-542b-3fa8-a751-297074027636|ZDJXRW42891424FK|新入网289元5G套餐24个月直降2800_非插卡|289元/月|24|3360\n" +
                "406c3619-3526-3cb4-80da-db3b25c98615|ZDJCLX1382430K|（201910存量自带机）承诺使用138元及以上4G套餐24个月每月减免30元话费（插卡类）|138元/月|24|720\n" +
                "bd9d616c-54ba-334f-b4b2-220986021bfb|ZDJCLX3881270K|（201910存量自带机）承诺使用388元及以上4G套餐12个月每月减免70元话费（插卡类）|388元/月|12|840\n" +
                "ea5e588b-b952-3795-a737-272a58274515|ZDJJT23824120FK|（家庭最低消费599元）承诺使用288元及以上4G套餐24个月每月减免120元话费（非插卡类）|289元/月|24|2880\n" +
                "658560fc-c97f-3c21-a7cf-8d021f4c2c0a|ZDJCL1882440K|（201908存量自带机）承诺升档至188元及以上4G套餐24个月每月减免40元话费（138元升档_插卡类）|188元/月|24|960\n" +
                "040873ec-22f9-3ed3-a5da-e4bd64a52b92|ZDJJT1382460FK|（家庭最低消费299元）承诺使用138元及以上4G套餐24个月每月减免60元话费（非插卡类）|139元/月|24|1440\n" +
                "29485398-79cd-3804-bb13-93f482096a20|ZDJXRW31393512K|加1元升档至139元6G套餐12期直降300_插卡|139元/月|12|420\n" +
                "e2986e54-2f39-38b8-9e6c-e52715dd0d13|ZDJXRW41397024FK|新入网139元5G套餐24个月直降1400_非插卡|139元/月|24|1680\n" +
                "0566891d-4b5b-3f13-b0cc-d093ff9424fb|ZDJJT1882480FK|（家庭最低消费399元）承诺使用188元及以上4G套餐24个月每月减免80元话费（非插卡类）|389元/月|24|1920\n" +
                "d985fbe0-79e2-39f5-8e49-0eed64001a82|ZDJXRW43891912FK|新入网389元5G套餐12个月直降2075_非插卡|389元/月|12|2280\n" +
                "bf2d092e-b75b-3c33-aa1a-ad1bb5bb5321|ZDJJT881240FK|承诺家庭低消199元12个月直降430（非插卡类）|138元/月|12|480\n" +
                "ecf0cc1d-6abc-3f0d-8bdf-de154d62da40|ZDJJT881240K|承诺家庭低消199元12个月直降430（插卡类）|89元/月|12|480\n" +
                "d6ca7482-c5cb-38f4-ac6f-f8a1dde04577|ZDJJT881240K|承诺家庭低消199元12个月直降430（插卡类）|188元/月|12|480\n" +
                "5fe1343d-604a-3862-b3c0-3adf66dfeb04|ZDJCL1881240K|（201908存量自带机）承诺升档至188元及以上4G套餐12个月每月减免40元话费（138元升档_插卡类）|188元/月|12|480\n" +
                "959660e2-38c6-313a-af82-292ed8321dad|ZDJJT882440FK|（家庭最低消费199元）承诺使用88元及以上4G套餐24个月每月减免40元话费（非插卡类）|188元/月|24|960\n" +
                "d7be1ae7-d85b-396f-8eb8-f18e2f0da3ad|ZDJJT1382460K|（家庭最低消费299元）承诺使用138元及以上4G套餐24个月每月减免60元话费（插卡类）|238元/月|24|1440\n" +
                "b048f3dd-a4ce-3680-a011-bcbd9831f07c|ZDJJT882440FK|（家庭最低消费199元）承诺使用88元及以上4G套餐24个月每月减免40元话费（非插卡类）|189元/月|24|960\n" +
                "83a4e216-7466-38a2-8671-2e127477c328|ZDJCL1081230K|（201910存量自带机）承诺升档至108元及以上4G套餐12个月每月减免30元话费（88元及以下_插卡类）|109元/月|12|360\n" +
                "7abffa4c-5dc4-3d55-9a73-5eacc5c11b8c|ZDJCL1081230FK|（201910存量自带机）承诺升档至108元及以上4G套餐12个月每月减免30元话费（88元及以下_非插卡类）|109元/月|12|360\n" +
                "54935392-7574-3e51-b501-1d67f2226e4e|ZDJCLX58824100K|（201910存量自带机）承诺使用588元及以上4G套餐24个月每月减免100元话费（插卡类）|588元/月|24|2400\n" +
                "00bdd231-f561-3126-992a-d9d9847ff31d|ZDJXRW31393524FK|加1元升档至139元17G套餐24期直降700_非插卡|139元/月|24|840\n" +
                "e021151d-1b6e-32cb-a24c-7d391ab8524f|ZDJCL882425FK|（201910存量自带机）承诺升档至88元及以上4G套餐24个月每月减免25元话费（88元及以下_非插卡类）|88元/月|24|600\n" +
                "690ffdd3-01e7-3a58-90d7-2801ec92cdd7|ZDJXRW1881270FK|（201908新入网自带机）承诺使用188元及以上4G套餐12个月每月减免70元话费（非插卡类）|188元/月|12|840\n" +
                "6ae80ca9-eeee-3a99-8d19-c89b73e7d29b|ZDJCL1218855K|（201910存量自带机）承诺升档至188元及以上4G套餐12个月每月减免55元话费（88元及以下升档_插卡类）|188元/月|12|660\n" +
                "192538ed-9783-30c8-907a-194dae8dafa1|ZDJJT1382460K|（家庭最低消费299元）承诺使用138元及以上4G套餐24个月每月减免60元话费（插卡类）|288元/月|24|1440\n" +
                "71720ceb-959a-35b6-bd0c-969ee4fb9cea|ZDJJT1882480K|（家庭最低消费399元）承诺使用188元及以上4G套餐24个月每月减免80元话费（插卡类）|239元/月|24|1920\n" +
                "400d8dfd-6c16-3d28-980e-9cffa4220666|ZDJJT23812120K|承诺家庭低消599元12个月直降1300（插卡类）|388元/月|12|1440\n" +
                "222e4f1b-0fe9-3b09-a4b9-311448c767de|ZDJXRW42898012FK|承诺升档至289元5G套餐12个月直降875元(非插卡类）|289元/月|12|960\n" +
                "0eee6d1c-9e18-35f0-8248-f0520fbd2e87|ZDJXRW358910024K|加1元升档至589元28G套餐24期直降2000_插卡|589元/月|24|2400\n" +
                "0738ba26-7e63-3979-bdb2-0e18fcb53b72|ZDJJT1881280K|承诺家庭低消399元12个月直降870（插卡类）|388元/月|12|960\n" +
                "16a42fbe-7118-37d3-a9ef-da7d897ed74b|ZDJCL1381240FK|（201908存量自带机）承诺升档至138元及以上4G套餐12个月每月减免40元话费（88元及以下_非插卡类）|138元/月|12|480\n" +
                "93a06342-d402-36f0-9a4e-8b1da766992d|ZDJJT23812120K|承诺家庭低消599元12个月直降1300（插卡类）|288元/月|12|1440\n" +
                "a08e807d-06ba-3418-8da9-2f3baabf6439|ZDJXRW323924K|新入网239元5G套餐24个月直降1600_插卡|239元/月|24|1920\n" +
                "ed4d7405-7445-3c24-93d6-f3fbeb925fc7|ZDJCL1382440FK|（201908存量自带机）承诺升档至138元及以上4G套餐24个月每月减免40元话费（88元及以下_非插卡类）|138元/月|24|960\n" +
                "f71287e6-7c7c-3fad-9d18-70f9840412ef|ZDJJT1882480FK|（家庭最低消费399元）承诺使用188元及以上4G套餐24个月每月减免80元话费（非插卡类）|188元/月|24|1920\n" +
                "44b8b15a-9da8-371e-b5b1-7511015ec6bf|ZDJJT1882480FK|（家庭最低消费399元）承诺使用188元及以上4G套餐24个月每月减免80元话费（非插卡类）|288元/月|24|1920\n" +
                "63d29538-3c43-3dd9-8496-c34db9a25a02|ZDJXRW881230FK|（201908新入网自带机）承诺使用88元及以上4G套餐12个月每月减免30元话费（非插卡类）|89元/月|12|360\n" +
                "160cfe71-1d04-38e1-862f-803b8af405f7|ZDJXRW313924FK|新入网139元5G套餐24个月直降1000_非插卡|139元/月|24|1200\n" +
                "4c834f95-58e3-33ce-845b-bae4dd019127|ZDJJT1382460K|（家庭最低消费299元）承诺使用138元及以上4G套餐24个月每月减免60元话费（插卡类）|139元/月|24|1440\n" +
                "1418337a-219b-39c0-b074-ed455696dad7|ZDJXRW45893024FK|新入网589元5G套餐24个月直降6000_非插卡|589元/月|24|7200\n" +
                "8e1650be-b577-3ee0-af28-3659c7604a48|ZDJXRW42898024FK|承诺升档至289元5G套餐24个月直降1600元(非插卡类）|289元/月|24|1920\n" +
                "e4916ac5-d210-3c51-9a54-6266cc175b10|ZDJXRW1082430K|（201908新入网自带机）承诺使用108元及以上4G套餐24个月每月减免30元话费（插卡类）|109元/月|24|720\n" +
                "cae62028-41b8-3d3b-9d0e-2c79968dfaf0|ZDJJT881240K|承诺家庭低消199元12个月直降430（插卡类）|139元/月|12|480\n" +
                "0e6ecb3f-a381-3093-b11f-f85cd748b16d|ZDJJT1381260FK|承诺家庭低消299元12个月直降650（非插卡类）|238元/月|12|720\n" +
                "ad603c97-1b29-3224-8fa0-5af598a41ee5|ZDJXRW882430FK|（201908新入网自带机）承诺使用88元及以上4G套餐24个月每月减免30元话费（非插卡类）|88元/月|24|720\n" +
                "4f572282-2ee3-34da-9fea-7c657e903976|ZDJJT1882480K|（家庭最低消费399元）承诺使用188元及以上4G套餐24个月每月减免80元话费（插卡类）|388元/月|24|1920\n" +
                "51523e37-3eb4-393c-ba07-033002c4b229|ZDJCL2882470FK|（201908存量自带机）承诺升档至288元及以上4G套餐24个月每月减免70元话费（188元及以下_非插卡类）|288元/月|24|1680\n" +
                "9aa01eb6-be9f-35af-a59c-1bebd8138326|ZDJCL2428860K|（201910存量自带机）承诺升档至288元及以上4G套餐24个月每月减免60元话费（238元升档_插卡类）|288元/月|24|1440\n" +
                "e0920bbe-3c20-3aa0-b7ec-3cc1d82bb92c|ZDJJT881240K|承诺家庭低消199元12个月直降430（插卡类）|88元/月|12|480\n" +
                "deaab59d-5e7b-3edd-bfa2-856521c0196f|ZDJCL2428860FK|（201910存量自带机）承诺升档至288元及以上4G套餐24个月每月减免60元话费（238元升档_非插卡类）|288元/月|24|1440\n" +
                "dfe9e206-bc72-330a-bcc5-63bc94bcadd8|ZDJXRW43891924FK|新入网389元5G套餐24个月直降3800_非插卡|389元/月|24|4560\n" +
                "8d76a2b8-c44e-3d49-bf9a-07a22003035f|ZDJCLX1881240K|（201910存量自带机）承诺使用188元及以上4G套餐12个月每月减免40元话费（插卡类）|188元/月|12|480\n" +
                "e41c4757-d6d6-31e3-90f3-980057ae6629|ZDJCLX1381230K|（201910存量自带机）承诺使用138元及以上4G套餐12个月每月减免30元话费（插卡类）|138元/月|12|360\n" +
                "79bf6c88-88bc-31ed-8083-a396b6811845|ZDJCL1223850FK|（201910存量自带机）承诺升档至238元及以上4G套餐12个月每月减免50元话费（188元及以下升档_非插卡类）|238元/月|24|1200\n" +
                "ce1841f2-3ada-3773-8c2d-6c2279b8f902|ZDJJT1381260FK|承诺家庭低消299元12个月直降650（非插卡类）|138元/月|12|720\n" +
                "7bba2db5-abc9-3289-99ed-0a56e0e82b28|ZDJJT882440K|（家庭最低消费199元）承诺使用88元及以上4G套餐24个月每月减免40元话费（插卡类）|188元/月|24|960\n" +
                "77a261c0-b031-348c-975b-723b3a10c86f|ZDJXRW328912FK|新入网289元5G套餐12个月直降1145_非插卡|289元/月|12|1260\n" +
                "adb02519-ff86-337f-b234-28d150af0483|ZDJJT1882480FK|（家庭最低消费399元）承诺使用188元及以上4G套餐24个月每月减免80元话费（非插卡类）|289元/月|24|1920\n" +
                "bf712903-dd3a-39da-bfef-75c2d2a859d9|ZDJJT882440K|（家庭最低消费199元）承诺使用88元及以上4G套餐24个月每月减免40元话费（插卡类）|138元/月|24|960\n" +
                "acce506f-7249-3154-b68c-83922ca01842|ZDJCL2881270FK|（201908存量自带机）承诺升档至288元及以上4G套餐12个月每月减免70元话费（188元及以下_非插卡类）|288元/月|12|840\n" +
                "ff02a91d-60d6-3536-bbe3-8800434c986f|ZDJJT881240K|承诺家庭低消199元12个月直降430（插卡类）|138元/月|12|480\n" +
                "b419d91e-06a8-38af-bc79-bae37873b339|ZDJXRW32896012FK|加1元升档至289元11G套餐12期直降655_非插卡|289元/月|12|720\n" +
                "60717abc-66a2-3f47-912b-3d2498fd6de5|ZDJJT23812120FK|承诺家庭低消599元12个月直降1300（非插卡类）|389元/月|12|1440\n" +
                "3d0ac314-c113-3f0f-9de0-9ede90ec1a4a|ZDJJT881240FK|承诺家庭低消199元12个月直降430（非插卡类）|188元/月|12|480\n" +
                "17da2fa6-35aa-3917-b3e9-ee204e6671a3|ZDJXRW319912K|新入网199元5G套餐12个月直降765_插卡|199元/月|12|840\n" +
                "fa343826-232c-3217-8227-32534e20c81f|ZDJJT1381260K|承诺家庭低消299元12个月直降650（插卡类）|238元/月|12|720\n" +
                "9e60f3e6-913e-3854-a350-7611414f2f81|ZDJXRW42391212K|新入网239元5G套餐12个月直降1310_插卡|239元/月|12|1440\n" +
                "34d99a0d-bf86-311a-b7ff-97e563386e7f|ZDJXRW33897024FK|加1元升档至389元25G套餐24期直降1400_非插卡|389元/月|24|1680\n" +
                "efe45dde-5b03-3258-bf5d-1e4ecb77aa66|ZDJCL881225FK|（201910存量自带机）承诺升档至88元及以上4G套餐12个月每月减免25元话费（88元及以下_非插卡类）|89元/月|12|300\n" +
                "23c283bd-b972-3e32-89f8-3977bee52b83|ZDJXRW358924K|新入网589元5G套餐24个月直降4000_插卡|589元/月|24|4800\n" +
                "cbb3caf6-f1ae-331e-b9ac-182c9b5b2d39|ZDJCL1381240K|（201908存量自带机）承诺升档至138元及以上4G套餐12个月每月减免40元话费（88元及以下_插卡类）|138元/月|12|480\n" +
                "8a7aebe2-7994-32f2-9b08-cd2fa8440aed|ZDJJT881240FK|承诺家庭低消199元12个月直降430（非插卡类）|88元/月|12|480\n" +
                "ca3f2fb9-681c-3510-a09e-feaf55e16fb3|ZDJJT1381260K|承诺家庭低消299元12个月直降650（插卡类）|289元/月|12|720\n" +
                "69ef1478-c98d-3a3e-bbc7-833f4b441000|ZDJXRW45893012FK|新入网589元5G套餐12个月直降3275_非插卡|589元/月|12|3600\n" +
                "ad9f35a4-dde9-32c2-be25-6bb415a828c7|ZDJXRW882430FK|（201908新入网自带机）承诺使用88元及以上4G套餐24个月每月减免30元话费（非插卡类）|89元/月|24|720\n" +
                "a6ec46f0-863a-3594-875c-9298f389d8db|ZDJJT1882480K|（家庭最低消费399元）承诺使用188元及以上4G套餐24个月每月减免80元话费（插卡类）|188元/月|24|1920\n" +
                "3b4fa377-4787-3f6e-a4f6-eae4073f204c|ZDJXRW41397012FK|新入网139元5G套餐12个月直降765_非插卡|139元/月|12|840\n" +
                "f688500b-e2e7-34af-98a6-6cf101325a36|ZDJCLX3882470FK|（201910存量自带机）承诺使用388元及以上4G套餐24个月每月减免70元话费（非插卡类）|388元/月|24|1680\n" +
                "122d2342-f797-3383-a16d-d4c7a5ae6b52|ZDJJT1882480K|（家庭最低消费399元）承诺使用188元及以上4G套餐24个月每月减免80元话费（插卡类）|288元/月|24|1920\n" +
                "279d313d-ba40-395a-ba9a-88372e185062|ZDJXRW882430K|（201908新入网自带机）承诺使用88元及以上4G套餐24个月每月减免30元话费（插卡类）|89元/月|24|720\n" +
                "1bb3666a-6e7b-3231-917e-6c087488838d|ZDJXRW881230K|（201908新入网自带机）承诺使用88元及以上4G套餐12个月每月减免30元话费（插卡类）|89元/月|12|360\n" +
                "c52ee801-bf59-355e-9ebe-7f953ccc24b1|ZDJCL1082430FK|（201910存量自带机）承诺升档至108元及以上4G套餐24个月每月减免30元话费（88元及以下_非插卡类）|108元/月|24|720\n" +
                "391acd1e-b39b-34d1-b1e5-4b3151fb3bf1|ZDJCL1881240FK|（201908存量自带机）承诺升档至188元及以上4G套餐12个月每月减免40元话费（138元升档_非插卡类）|188元/月|12|480\n" +
                "a9efb37a-d536-39e8-8165-d942a7585543|ZDJXRW41397012K|新入网139元5G套餐12个月直降765_插卡|139元/月|12|840\n" +
                "ab3e264a-3fbd-3773-b08c-4085d980c004|ZDJJT1882480K|（家庭最低消费399元）承诺使用188元及以上4G套餐24个月每月减免80元话费（插卡类）|289元/月|24|1920\n" +
                "27b6719d-f5cf-3e97-9776-6e3f1ce15483|ZDJXRW338912FK|新入网389元5G套餐12个月直降1530_非插卡|389元/月|12|1680\n" +
                "22fd73cd-5990-3177-a31f-354e14eb53e0|ZDJCL2428880FK|（201910存量自带机）承诺升档至288元及以上4G套餐24个月每月减免80元话费（188元及以下升档_非插卡类）|288元/月|24|1920\n" +
                "e9ef68c2-5bfe-3272-b7a4-49cbf6ae073f|ZDJCL1082430K|（201910存量自带机）承诺升档至108元及以上4G套餐24个月每月减免30元话费（88元及以下_插卡类）|108元/月|24|720\n" +
                "75794011-3a07-317a-b0a3-2560f46f377d|ZDJXRW1082430FK|（201908新入网自带机）承诺使用108元及以上4G套餐24个月每月减免30元话费（非插卡类）|109元/月|24|720\n" +
                "a57e1827-5213-3215-9edf-d1ecf2156f0f|ZDJJT1381260FK|承诺家庭低消299元12个月直降650（非插卡类）|239元/月|12|720\n" +
                "25170c8d-79d4-32a7-a198-5efbcc9cc38f|ZDJXRW323912K|新入网239元5G套餐12个月直降870_插卡|239元/月|12|960\n" +
                "c6ff2b31-edb4-314e-bcbd-6ce18ceaae4d|ZDJJT1881280K|承诺家庭低消399元12个月直降870（插卡类）|289元/月|12|960\n" +
                "eda60cb5-d842-37b2-a81b-9cb105a198f9|ZDJCL1081230FK|（201910存量自带机）承诺升档至108元及以上4G套餐12个月每月减免30元话费（88元及以下_非插卡类）|108元/月|12|360\n" +
                "6cc3b16f-2b41-3b3a-996d-d64c37c5e075|ZDJXRW42391224K|新入网239元5G套餐24个月直降2400_插卡|239元/月|24|2880\n" +
                "795d2972-6d9b-3124-993f-7b9ef33173a3|ZDJXRW319912FK|新入网199元5G套餐12个月直降765_非插卡|199元/月|12|840\n" +
                "e86c256f-4b61-3174-951e-197f68db6899|ZDJXRW41991024FK|新入网199元5G套餐24个月直降2000_非插卡|199元/月|24|2400\n" +
                "776b38ad-8108-3e9f-8e72-6e44a6999418|ZDJXRW42397012FK|承诺升档至239元5G套餐12个月直降765元(非插卡类）|239元/月|12|840\n" +
                "838e2c87-3d51-346f-a908-e1ed25b4e119|ZDJXRW338924K|新入网389元5G套餐24个月直降2800_插卡|389元/月|24|3360\n" +
                "141d21c6-965e-3782-95b3-c76d375239df|ZDJCL882425K|（201910存量自带机）承诺升档至88元及以上4G套餐24个月每月减免25元话费（88元及以下_插卡类）|89元/月|24|600\n" +
                "490137bc-4e2c-3624-8534-0393371667ce|ZDJXRW41991024K|新入网199元5G套餐24个月直降2000_插卡|199元/月|24|2400\n" +
                "4f1a71ff-7fdf-3972-946c-820e5d6e24d6|ZDJCLX2882450FK|（201910存量自带机）承诺使用288元及以上4G套餐24个月每月减免50元话费（非插卡类）|288元/月|24|1200\n" +
                "f333d935-e2b6-3240-98b5-eb1a4d3f75e3|ZDJCL1228860FK|（201910存量自带机）承诺升档至288元及以上4G套餐12个月每月减免60元话费（238元升档_非插卡类）|288元/月|12|720\n" +
                "84660066-a3c5-3264-ab51-4ab2590251d2|ZDJXRW1081230K|（201908新入网自带机）承诺使用108元及以上4G套餐12个月每月减免30元话费（插卡类）|108元/月|12|360\n" +
                "4c83d1e3-1363-3202-af82-4b2df9b3484a|ZDJXRW3189435FK|承诺升档至189元5G套餐12个月直降435元(非插卡类）|189元/月|12|480\n" +
                "c6db75c6-9061-318c-90c2-3ba179f3c75a|ZDJXRW338924FK|新入网389元5G套餐24个月直降2800_非插卡|389元/月|24|3360\n" +
                "e264f49a-421c-3f0c-8826-75643ae2d565|ZDJCLX1881240FK|（201910存量自带机）承诺使用188元及以上4G套餐12个月每月减免40元话费（非插卡类）|188元/月|12|480\n" +
                "3321fd9b-f010-3f3a-9252-f2d01d99181a|ZDJJT1381260FK|承诺家庭低消299元12个月直降650（非插卡类）|139元/月|12|720\n" +
                "c9909423-18d4-36bf-8b73-fb27340a067f|ZDJXRW32395012FK|加1元升档至239元5G套餐12期直降545_非插卡|239元/月|12|600\n" +
                "be12b7ac-5b50-3da1-954f-047aeeee34e8|ZDJXRW328912K|新入网289元5G套餐12个月直降1145_插卡|289元/月|12|1260\n" +
                "24617c77-831b-370a-951e-9c2f33e41d7d|ZDJXRW31891400FK|承诺升档至189元5G套餐24个月直降1400元(非插卡类）|189元/月|24|1680\n" +
                "8b6906ef-8105-380e-92a6-6374b2ba5d93|ZDJJT1382460FK|（家庭最低消费299元）承诺使用138元及以上4G套餐24个月每月减免60元话费（非插卡类）|238元/月|24|1440\n" +
                "c8a9023b-89a6-3ac2-b329-4755c2d21991|ZDJJT1881280K|承诺家庭低消399元12个月直降870（插卡类）|288元/月|12|960\n" +
                "374756cc-319b-3306-bd6e-c4b2dde7bfa8|ZDJXRW43898024FK|承诺升档至389元5G套餐24个月直降1600元(非插卡类）|389元/月|24|1920\n" +
                "7b739e75-3c75-357d-bfa3-3d416b9199e9|ZDJJT882440FK|（家庭最低消费199元）承诺使用88元及以上4G套餐24个月每月减免40元话费（非插卡类）|138元/月|24|960\n" +
                "225235e8-518a-3055-909e-b014b656e7e9|ZDJJT1882480FK|（家庭最低消费399元）承诺使用188元及以上4G套餐24个月每月减免80元话费（非插卡类）|238元/月|24|1920\n" +
                "8133bc97-8d2b-33b3-922a-0f47eddfe669|ZDJXRW1081230FK|（201908新入网自带机）承诺使用108元及以上4G套餐12个月每月减免30元话费（非插卡类）|109元/月|12|360\n" +
                "184b8ec5-dcc6-3a63-a522-6076d5bb3307|ZDJCLX2382440K|（201910存量自带机）承诺使用238元及以上4G套餐24个月每月减免40元话费（插卡类）|238元/月|24|960\n" +
                "bc9d3ea2-cbb2-36ee-99cc-699edbbc614e|ZDJXRW1882470FK|（201908新入网自带机）承诺使用188元及以上4G套餐24个月每月减免70元话费（非插卡类）|188元/月|24|1680\n" +
                "e24f5451-5e0d-32b8-b8d6-6c46dab1845b|ZDJCL2882440K|（201908存量自带机）承诺升档至288元及以上4G套餐24个月每月减免40元话费（238元升档_插卡类）|288元/月|24|960\n" +
                "65f98b31-80fe-3360-883c-e28467cf85ab|ZDJJT1382460FK|（家庭最低消费299元）承诺使用138元及以上4G套餐24个月每月减免60元话费（非插卡类）|189元/月|24|1440\n" +
                "e432c01e-bac1-35e7-8988-2e9b7936d647|ZDJXRW41394024K|承诺升档至139元5G套餐24个月直降800元(插卡类）|139元/月|24|960\n" +
                "aaeaaa4d-d7a6-3d78-b1d2-ebc0ede7c951|ZDJJT23824120K|（家庭最低消费599元）承诺使用288元及以上4G套餐24个月每月减免120元话费（插卡类）|388元/月|24|2880\n" +
                "ea563ef8-b404-39f9-a5bf-bad7f1bf5adf|ZDJXRW32395024FK|加1元升档至239元21G套餐24期直降1000_非插卡|239元/月|24|1200\n" +
                "14397475-7858-3117-bc47-90fe38f727ab|ZDJXRW45893012K|新入网589元5G套餐12个月直降3275_插卡|589元/月|12|3600\n" +
                "b232a694-997e-3728-b70c-411eadb9bbb6|ZDJXRW358924FK|新入网589元5G套餐24个月直降4000_非插卡|589元/月|24|4800";
        String[] setMeals = s.split("\n");
        List<SetMeal> mealList = new ArrayList<>();
        StringBuffer insert = new StringBuffer();
        StringBuffer update = new StringBuffer();
        for (String sm:setMeals){
            String[] strings = sm.split("\\|");
            SetMeal meal = new SetMeal();
            meal.setPackageNo(strings[0]);
            meal.setTradeMark(strings[1]);
            meal.setTitle(strings[2]);
            meal.setTotalAmount(MoneyUtil.formatMoney(strings[5]));
            meal.setNum(Integer.valueOf(strings[4]));
            meal.setAmount(MoneyUtil.divide(meal.getTotalAmount(),meal.getNum().toString()));
            meal.setAppId("201910091625131208151");
            meal.setRedPackAmount(getRedAmount(meal.getTotalAmount()));
            meal.setState(1);
            if (meal.getNum() == 24){
               meal.setRedPackState(1);
            }else {
                meal.setRedPackState(0);
            }
            if (meal.getNum().equals(12)){
                meal.setSettleAmount(MoneyUtil.formatMoney(jisuans(meal.getTotalAmount(),"1.1")));
            }else if (meal.getNum().equals(24)){
                meal.setSettleAmount(MoneyUtil.formatMoney(jisuan(meal.getTotalAmount(),"1.2")));
            }
            SetMeal setMeal = setMealService.queryByPackageNo(meal.getPackageNo());
            if (setMeal!= null){
                System.err.println(setMeal.getPackageNo());
                insert.append(meal.getId()).append(",");
            }else {
                setMealService.insert(meal);
                insert.append(meal.getId()).append(",");
            }
            mealList.add(meal);
        }
        System.err.println(insert.toString());
        System.err.println(update.toString());
    }


    @Test
    public void refund(){
        PayOrder order = payOrderService.queryByOutOrderNo( "76403234672473");
        if (order == null){
            return;
        }
        Refund refund = new Refund();
        refund.setOutTradeNo(order.getOutTradeNo());
        refund.setAmount(order.getAmount());
        refund.setOutRequestNo(StringUtils.getTradeNo());
        refund.setReason("业务回退");
        refund.setType(0);
        RefundResult result = authorizePayService.refund(refund);
        if (result.isSuccess()){
            myBankSupplyChainService.tradeRepay(order.getAuthNo());
        }
        System.err.println(result);
    }


    private String getRedAmount(String amount){
        int i = new BigDecimal(amount).compareTo(new BigDecimal(800));
        int j = new BigDecimal(amount).compareTo(new BigDecimal(1000));
        if (i ==-1){
           return "15.00";
        }
        if ((i==1 || i==0) && j == -1 ){
           return "25.00";
        }
        if (j==0 || j == 1 ){
           return "30.00";
        }
        return null;
    }

    @Test
    public void refunds(){
        PayOrder order = payOrderService.queryById(53l);
        SendMessage.sendMessage(JmsMessaging.ORDER_NOTIFY_MESSAGE,JSONObject.toJSONString(order));
    }


    /**
     * 查询是否有正在审核中的商户
     *
     * @param dto
     * @return
     */
    private AuthorizeMerchant createAuthorizeMerchant(RegisterMerchant dto) {
        AuthorizeMerchant queryMerchant = new AuthorizeMerchant();
        queryMerchant.setMerchantNo(dto.getMerchantNo());
        List<AuthorizeMerchant>  merchantList = authorizeMerchantService.queryList(queryMerchant);
        if (DataUtil.isNotEmpty(merchantList)){
            boolean flag = false;
            for (AuthorizeMerchant merchant:merchantList){
                if (merchant.isSuccess()){
                    flag = true;
                }
            }
            if (flag){
                return null;
            }
        }
        AuthorizeMerchant merchant = new AuthorizeMerchant();
        merchant.setAppId(dto.getAppId());
        merchant.setWayId(dto.getWayId());
        merchant.setMerchantNo(dto.getMerchantNo());
        merchant.setContactName(dto.getContactName());
        merchant.setContactPhone(dto.getContactPhone());
        merchant.setCreateTime(new Date());
        merchant.setName(dto.getName());
        merchant.setOperatorName(dto.getOperatorName());
        merchant.setStoreSubjectName(dto.getStoreSubjectName());
        merchant.setStoreSubjectCertNo(dto.getStoreSubjectCertNo());
        merchant.setStoreNo(dto.getStoreNo());
        merchant.setStoreName(dto.getStoreName());
        merchant.setStoreProvince(dto.getStoreProvince());
        merchant.setStoreCity(dto.getStoreCity());
        merchant.setStoreCounty(dto.getStoreCounty());
        merchant.setStoreProvinceCode(dto.getStoreProvinceCode());
        merchant.setStoreCityCode(dto.getStoreCityCode());
        merchant.setStoreCountyCode(dto.getStoreCountyCode());
        merchant.setSellerNo(dto.getSellerNo());
        merchant.setState(AuthorizeMerchant.State.waiting.getCode());
        authorizeMerchantService.insert(merchant);
        System.err.println(merchant.getId());
        return merchant;
    }


    /**
     * 签约商户
     *
     * @param merchant
     * @return （原因）没有返回，则为签约成功
     */
    private void createSupplier(AuthorizeMerchant merchant) {
        AuthorizeMerchant oldMerchant = authorizeMerchantService.queryByAliPayLoginNo(merchant.getSellerNo());
        if (oldMerchant != null ) {
            if (oldMerchant.getState().equals(AuthorizeMerchant.State.success.getCode())){
                merchant.setSupplierNo(oldMerchant.getSupplierNo());
                merchant.setState(AuthorizeMerchant.State.success.getCode());
                merchant.setFinishTime(new Date());
                authorizeMerchantService.updateById(merchant);
                return ;
            }else if (oldMerchant.getState().equals(AuthorizeMerchant.State.failed.getCode())){
                merchant.setReason(oldMerchant.getReason());
                merchant.setState(AuthorizeMerchant.State.failed.getCode());
                merchant.setFinishTime(new Date());
                authorizeMerchantService.updateById(merchant);
                return ;
            }
        }
        if ( oldMerchant == null || (oldMerchant!= null && oldMerchant.getState().equals(AuthorizeMerchant.State.waiting.getCode()))){
            AuthorizeConfiguration configuration = authorizeConfigurationService.queryDefaultConfiguration();
            MybankCreditSupplychainFactoringSupplierCreateResponse response = SupplyChainUtils.createSupplier(create(merchant),configuration);
            if (response.isSuccess()) {
                merchant.setSupplierNo(response.getSupplierNo());
                merchant.setState(AuthorizeMerchant.State.success.getCode());
                merchant.setFinishTime(new Date());
            } else {
                merchant.setReason(response.getSubMsg());
                merchant.setState(AuthorizeMerchant.State.failed.getCode());
                merchant.setFinishTime(new Date());
            }
            authorizeMerchantService.updateById(merchant);
            return ;
        }
    }



    /**
     * 创建商户
     *
     * @param merchant
     * @return
     */
    private SuppilerCreate create(AuthorizeMerchant merchant) {
        SuppilerCreate create = new SuppilerCreate();
        create.setStoreNo(merchant.getSellerNo());
        create.setSellerName(merchant.getName());
        create.setRcvContactEmail(null);
        create.setRcvLoginId(merchant.getSellerNo());
        create.setRcvContactName(merchant.getContactName());
        create.setRcvContactPhone(merchant.getContactPhone());
        create.setOperatorName(merchant.getOperatorName());
        create.setStoreNo(merchant.getStoreNo());
        create.setStoreName(merchant.getStoreName());
        create.setStoreSubjectName(merchant.getStoreSubjectName());
        create.setStoreSubjectCertNo(merchant.getStoreSubjectCertNo());
        create.setStoreProvince(merchant.getStoreProvince());
        create.setStoreCity(merchant.getStoreCity());
        create.setStoreCounty(merchant.getStoreCounty());
        return create;
    }


    private String jisuan(String money,String fee){
        return MoneyUtil.divide(money,fee);
    }

    private String jisuans(String money,String fee){
        Double my = Double.valueOf(MoneyUtil.divide(money,fee));
        Double yushu = my % 5;
        if (yushu > 2.5){
            return MoneyUtil.formatMoney(String.valueOf(my - yushu + 5d));
        }else {
            return MoneyUtil.formatMoney(String.valueOf(my - yushu));
        }
    }
}
